programming/20230601215947-jsown.org
:PROPERTIES:
:ID:       3e758af6-90ec-4ecc-a23a-80331343cf31
:END:
#+TITLE: jsown
#+CREATED: [2023-06-01 Thu 21:59]
#+LAST_MODIFIED: [2023-06-01 Thu 22:09]
* JSOWN
This is my preferred [[id:60758dc6-c4eb-4b34-9b56-fff31f17ef1d][json]] library.
From the readme:

jsown is a high performance common lisp json parser.

#+begin_src lisp
  (jsown:parse "{\"foo\":\"bar\",\"baz\":100.25}")
#+end_src

#+RESULTS:
: (:OBJ (foo . bar) (baz . 401/4))
Without any extra arguments, the parse function will return all keywords. In order to select only a few keywords, you can add those keywords in which you’re interested:

#+begin_src lisp
  (jsown:parse "{\"foo\":\"bar\",\"frolic\":100,\"fragrance\":10.01,\"for\":\"markup\"}" "foo" "frolic" "fragrance")

#+end_src

#+RESULTS:
: (:OBJ (foo . bar) (frolic . 100) (fragrance . 1001/100))

** Creating, parsing and reading.
You can make a new json object with ~new-js~ and ~extend-js~.
This is really the killer reason I use ~jsown~.
#+begin_src lisp
(jsown:new-js
  ("org" "roam")
  ("results" (* 100 2.25)))
#+end_src

#+RESULTS:
: (:OBJ (org . roam) (results . 225.0))

You can turn that into json like this.

#+begin_src lisp
(jsown:to-json (jsown:new-js
                     ("org" "roam")
                     ("results" (* 100 2.25))))

#+end_src

#+RESULTS:
: {"org":"roam","results":225.0}

You can read values using the ~val~ function

Here is a more complete example.
#+begin_src lisp
(setq data (jsown:to-json (jsown:new-js ("foo" "bar"))))
(setq json-data (jsown:parse data))
(jsown:val json-data "foo")
#+end_src

#+RESULTS:
: bar


The ~to-json~ json is a clos method so you can override that and add support for your custom objects.
