programming/20230601215947-jsown.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jsown</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">jsown</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org792fa88">JSOWN</a>
<ul>
<li><a href="#org320cce8">Creating, parsing and reading.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org792fa88" class="outline-2">
<h2 id="org792fa88">JSOWN</h2>
<div class="outline-text-2" id="text-org792fa88">
<p>
This is my preferred <a href="20230601220331-json.html#ID-60758dc6-c4eb-4b34-9b56-fff31f17ef1d">json</a> library.
From the readme:
</p>

<p>
jsown is a high performance common lisp json parser.
</p>

<div class="org-src-container">
<pre class="src src-lisp">  <span style="color: #1ea8fc;">(</span>jsown:parse <span style="color: #7984D1;">"{\"foo\":\"bar\",\"baz\":100.25}"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
<p>
Without any extra arguments, the parse function will return all keywords. In order to select only a few keywords, you can add those keywords in which you’re interested:
</p>

<div class="org-src-container">
<pre class="src src-lisp">  <span style="color: #1ea8fc;">(</span>jsown:parse <span style="color: #7984D1;">"{\"foo\":\"bar\",\"frolic\":100,\"fragrance\":10.01,\"for\":\"markup\"}"</span> <span style="color: #7984D1;">"foo"</span> <span style="color: #7984D1;">"frolic"</span> <span style="color: #7984D1;">"fragrance"</span><span style="color: #1ea8fc;">)</span>

</pre>
</div>
</div>

<div id="outline-container-org320cce8" class="outline-3">
<h3 id="org320cce8">Creating, parsing and reading.</h3>
<div class="outline-text-3" id="text-org320cce8">
<p>
You can make a new json object with <code>new-js</code> and <code>extend-js</code>.
This is really the killer reason I use <code>jsown</code>.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>jsown:new-js
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"org"</span> <span style="color: #7984D1;">"roam"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"results"</span> <span style="color: #a7da1e;">(</span>* <span style="color: #ffd400; font-weight: bold;">100</span> <span style="color: #ffd400; font-weight: bold;">2.25</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
You can turn that into json like this.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>jsown:to-json <span style="color: #ff2afc;">(</span>jsown:new-js
                     <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"org"</span> <span style="color: #7984D1;">"roam"</span><span style="color: #a7da1e;">)</span>
                     <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"results"</span> <span style="color: #df85ff;">(</span>* <span style="color: #ffd400; font-weight: bold;">100</span> <span style="color: #ffd400; font-weight: bold;">2.25</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>

</pre>
</div>

<p>
You can read values using the <code>val</code> function
</p>

<p>
Here is a more complete example.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>setq data <span style="color: #ff2afc;">(</span>jsown:to-json <span style="color: #a7da1e;">(</span>jsown:new-js <span style="color: #df85ff;">(</span><span style="color: #7984D1;">"foo"</span> <span style="color: #7984D1;">"bar"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>setq json-data <span style="color: #ff2afc;">(</span>jsown:parse data<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>jsown:val json-data <span style="color: #7984D1;">"foo"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>


<p>
The <code>to-json</code> json is a clos method so you can override that and add support for your custom objects.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>